#pragma once

#include <Windows.h>
#include "GWStructPositions.h"

/*
Server to client packets, sorted by header

most packets are not filled in, however the list and types of 
fields is given as comments

feel free to fill packets, and you can also add a suffix to 
the packet name, e.g. P391 -> P391_InstanceLoadMap
*/

namespace GWCA {

	namespace StoC {
		struct PacketBase {
			DWORD header;
		};

		template <class Specific>
		struct Packet : PacketBase {
		public:
			static const DWORD STATIC_HEADER;
		};


		struct P000 : Packet<P000> {
			// DWORD
		};
		const DWORD Packet<P000>::STATIC_HEADER = 0;

		struct P001_PingRequest : Packet<P001_PingRequest> {
		};
		const DWORD Packet<P001_PingRequest>::STATIC_HEADER = 1;

		struct P002_PingReply : Packet<P002_PingReply> {
			DWORD data;
		};
		const DWORD Packet<P002_PingReply>::STATIC_HEADER = 2;

		struct P003 : Packet<P003> {
			// DWORD
			// DWORD
			// wchar_t array[256] // prefixType="int16"
			// wchar_t array[256] // prefixType="int16"
		};
		const DWORD Packet<P003>::STATIC_HEADER = 3;

		struct P004 : Packet<P004> {
			// WORD
			// WORD
			// WORD
		};
		const DWORD Packet<P004>::STATIC_HEADER = 4;

		struct P005 : Packet<P005> {
			// BYTE
		};
		const DWORD Packet<P005>::STATIC_HEADER = 5;

		struct P006 : Packet<P006> {
			// WORD
		};
		const DWORD Packet<P006>::STATIC_HEADER = 6;

		struct P007 : Packet<P007> {
			// WORD
		};
		const DWORD Packet<P007>::STATIC_HEADER = 7;

		struct P008 : Packet<P008> {
			// BYTE
		};
		const DWORD Packet<P008>::STATIC_HEADER = 8;

		struct P009 : Packet<P009> {
			// BYTE
			// DWORD
			// DWORD
		};
		const DWORD Packet<P009>::STATIC_HEADER = 9;

		struct P010 : Packet<P010> {
			// BYTE
			// DWORD
		};
		const DWORD Packet<P010>::STATIC_HEADER = 10;

		struct P011 : Packet<P011> {
			// wchar_t array[122] // prefixType="int16"
		};
		const DWORD Packet<P011>::STATIC_HEADER = 11;

		struct P012 : Packet<P012> {
			// BYTE
			// BYTE
			// DWORD
			// DWORD
			// BYTE
		};
		const DWORD Packet<P012>::STATIC_HEADER = 12;

		struct P013 : Packet<P013> {
			// int[8] // prefixType="int16"
		};
		const DWORD Packet<P013>::STATIC_HEADER = 13;

		struct P014 : Packet<P014> {
			// WORD
			// BYTE
			// <Field occurs="64" prefixType="int8" type="nested">
			// DWORD
		};
		const DWORD Packet<P014>::STATIC_HEADER = 14;

		struct P015 : Packet<P015> {
			// WORD
			// <Field occurs="64" prefixType="int8" type="nested">
			// DWORD
		};
		const DWORD Packet<P015>::STATIC_HEADER = 15;

		struct P016 : Packet<P016> {
		};
		const DWORD Packet<P016>::STATIC_HEADER = 16;

		struct P017 : Packet<P017> {
			// WORD
			// BYTE
		};
		const DWORD Packet<P017>::STATIC_HEADER = 17;

		struct P018 : Packet<P018> {
			// int[128] // prefixType="int16"
		};
		const DWORD Packet<P018>::STATIC_HEADER = 18;

		// Heartbeat
		struct P019 : Packet<P019> {
			// DWORD
		};
		const DWORD Packet<P019>::STATIC_HEADER = 19;

		struct P020 : Packet<P020> {
			// DWORD
		};
		const DWORD Packet<P020>::STATIC_HEADER = 20;

		// spawn object
		struct P021 : Packet<P021> {
			DWORD agent_id;
			DWORD data1;	// for agents, this most likely pointer to the 3d file ID
							// for items, this is a "Local ID" that was sent by P343 or P344
			DWORD data2;		// 1 moving agents, 2 signposts, 3 chests [?], 4 items
			DWORD data3;		// 0 items, 1 signposts, 9 agents
			GW::GamePos pos;
			float rotation1;//0x0020 those 2 values are both between -1 and 1, and look like 
			float rotation2;//0x0024 rotations. Maybe cos/sin? Idk, but one of them is definitely rotation.
			DWORD unk2;		//0x0028 
			float speed;	//0x002C 
			float unk3;		//0x0030 
			float unk4;		//0x0034 0 items, agents 12, signposts 20
			DWORD unk5;		//0x0038 zero for items, weird big value for agents
			DWORD unk6;		//0x003C 
			DWORD unk7;		//0x0040 
			DWORD unk8;		//0x0044 
			DWORD unk9;		//0x0048 
			DWORD unk10;	//0x004C 
			float unk11;	//0x0050 a value between -100 and 100 for agents, Inf for items
			float unk12;	//0x0054 a value between -100 and 100 for agents, Inf for items
			GW::GamePos pos1; // similar to position, maybe patrol destination? {Inf, Inf, 0} for items
			DWORD unk16;	//0x0064 always zero
			GW::GamePos pos2; // same as pos1
		};
		const DWORD Packet<P021>::STATIC_HEADER = 21;

		struct P022 : Packet<P022> {
			DWORD agent_id;
		};
		const DWORD Packet<P022>::STATIC_HEADER = 22;

		struct P023 : Packet<P023> {
			// DWORD
			// DWORD
		};
		const DWORD Packet<P023>::STATIC_HEADER = 23;

		struct P024 : Packet<P024> {
			// DWORD
			// DWORD
		};
		const DWORD Packet<P024>::STATIC_HEADER = 24;

		struct P025 : Packet<P025> {
			// DWORD
			// DWORD
		};
		const DWORD Packet<P025>::STATIC_HEADER = 25;

		struct P026 : Packet<P026> {
			// DWORD
			// Vector2f
			// BYTE
		};
		const DWORD Packet<P026>::STATIC_HEADER = 26;

		struct P027 : Packet<P027> {
			// DWORD
			// BYTE
		};
		const DWORD Packet<P027>::STATIC_HEADER = 27;

		struct P028 : Packet<P028> {
			// DWORD
			// float
		};
		const DWORD Packet<P028>::STATIC_HEADER = 28;

		struct P029 : Packet<P029> {
			// DWORD
		};
		const DWORD Packet<P029>::STATIC_HEADER = 29;

